PHP/lab8/index.org
* Lab 8
#+BEGIN_VERSE
Lab Number: 8
Program Name if applicable: Lab8
Author name and email addres: Keegan Bailey, kbailey.v@gmail.com
Date of submission: 3/2/2013
Time estimated to complete the lab: 6 hours
Actual time taken to complete the lab: 8 hours
A description of the program: Use MVC to make SQL querys
required to run the program if applicable: controller.php, model.php, toXML.php, view.xsl, sq_connect.inc
#+END_VERSE
** Pseudocode
#+begin_src html
Edit ToXML and XSL for the controller and model
Write the controller to use a isset to check for input
-  Define default seach if no input around
-  Match input to xsl's forum
Create a model for controller
Get input checks done, and break down the SQL seach into an array
-  Get array to hold names of keys for search, and sub values
-  Feel array back to controller for output. 
#+end_src
*** controller.php
#+begin_src php
<?php
require_once "model.php";
require_once "toXML.php";

//check to see if something has been posted by the model
if(isset($_POST['input'])) {
	$input = $_POST['input'];
	$select = $input[0];
	$from = $input[1];
	$where = $input[2];
  } else {
	$select = "*";
	$from = "jobs";
	$where = "lower(job_id) = 'ad_pres'";
  }	
	
// Pass it to the model
$things = sqlsearch($select, $from, $where);

// Convert data from the model to xml
$xml = toXML($things);

// Output the xml to the view;
header('Content-Type: text/xml');
echo $xml; 	
?>
#+end_src
