PHP/lab8/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="index"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-02T02:18-0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">index</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Lab 8</a>
<ul>
<li><a href="#sec-1-1">1.1 Pseudocode</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 controller.php</a></li>
<li><a href="#sec-1-1-2">1.1.2 model.php</a></li>
<li><a href="#sec-1-1-3">1.1.3 toXML.php</a></li>
<li><a href="#sec-1-1-4">1.1.4 sq<sub>connect</sub>.inc</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lab 8</h2>
<div class="outline-text-2" id="text-1">


<p class="verse">
Lab Number: 8<br/>
Program Name if applicable: Lab8<br/>
Author name and email addres: Keegan Bailey, kbailey.v@gmail.com<br/>
Date of submission: 3/2/2013<br/>
Time estimated to complete the lab: 6 hours<br/>
Actual time taken to complete the lab: 8 hours<br/>
A description of the program: Use MVC to make SQL querys<br/>
required to run the program if applicable: controller.php, model.php, toXML.php, view.xsl, sq<sub>connect</sub>.inc<br/>
</p>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Pseudocode</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-html">Edit ToXML and XSL for the controller and model
Write the controller to use a isset to check for input
-  Define default seach if no input around
-  Match input to xsl's forum
Create a model for controller
Get input checks done, and break down the SQL seach into an array
-  Get array to hold names of keys for search, and sub values
-  Feel array back to controller for output. 
</pre>


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> controller.php</h4>
<div class="outline-text-4" id="text-1-1-1">




<pre class="src src-php"><span style="color: #483d8b;">&lt;?php</span>
<span style="color: #a020f0;">require_once</span> <span style="color: #8b2252;">"model.php"</span>;
<span style="color: #a020f0;">require_once</span> <span style="color: #8b2252;">"toXML.php"</span>;

<span style="color: #b22222;">//</span><span style="color: #b22222;">check to see if something has been posted by the model</span>
<span style="color: #a020f0;">if</span>(<span style="color: #000000; background-color: #ffffff;">isset(</span>$<span style="color: #008b8b;">_POST</span>[<span style="color: #8b2252;">'input'</span>])) {
        $<span style="color: #a0522d;">input</span> = $<span style="color: #008b8b;">_POST</span>[<span style="color: #8b2252;">'input'</span>];
        $<span style="color: #a0522d;">select</span> = $<span style="color: #a0522d;">input</span>[<span style="color: #000000; background-color: #ffffff;">0</span>];
        $<span style="color: #a0522d;">from</span> = $<span style="color: #a0522d;">input</span>[<span style="color: #000000; background-color: #ffffff;">1</span>];
        $<span style="color: #a0522d;">where</span> = $<span style="color: #a0522d;">input</span>[<span style="color: #000000; background-color: #ffffff;">2</span>];
  } <span style="color: #a020f0;">else</span> {
        $<span style="color: #a0522d;">select</span> = <span style="color: #8b2252;">"*"</span>;
        $<span style="color: #a0522d;">from</span> = <span style="color: #8b2252;">"jobs"</span>;
        $<span style="color: #a0522d;">where</span> = <span style="color: #8b2252;">"lower(job_id) = 'ad_pres'"</span>;
  }     

<span style="color: #b22222;">// </span><span style="color: #b22222;">Pass it to the model</span>
$<span style="color: #a0522d;">things</span> = <span style="color: #000000; background-color: #ffffff;">sqlsearch(</span>$<span style="color: #a0522d;">select</span>, $<span style="color: #a0522d;">from</span>, $<span style="color: #a0522d;">where</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">Convert data from the model to xml</span>
$<span style="color: #a0522d;">xml</span> = <span style="color: #000000; background-color: #ffffff;">toXML(</span>$<span style="color: #a0522d;">things</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">Output the xml to the view;</span>
<span style="color: #000000; background-color: #ffffff;">header(</span><span style="color: #8b2252;">'Content-Type: text/xml'</span>);
<span style="color: #a020f0;">echo</span> $<span style="color: #a0522d;">xml</span>;      
<span style="color: #483d8b;">?&gt;</span>
</pre>

</div>

</div>
