PHP/lab8/index.html

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> model.php</h4>
<div class="outline-text-4" id="text-1-1-2">




<pre class="src src-php"><span style="color: #483d8b;">&lt;?php</span>
<span style="color: #b22222;">//</span><span style="color: #b22222;">Model Module</span>
<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">sqlsearch</span>($<span style="color: #a0522d;">select</span>, $<span style="color: #a0522d;">from</span>, $<span style="color: #a0522d;">where</span>) {
        $<span style="color: #a0522d;">ds</span> = $<span style="color: #a0522d;">select</span>;
        $<span style="color: #a0522d;">df</span> = $<span style="color: #a0522d;">from</span>;

        <span style="color: #b22222;">//</span><span style="color: #b22222;">set up regex for input checks </span>
        $<span style="color: #a0522d;">notCoolBro</span> = <span style="color: #8b2252;">'/(\bdrop\b|\btruncate\b|;)/i'</span>;

        <span style="color: #000000; background-color: #ffffff;">preg_match(</span>$<span style="color: #a0522d;">notCoolBro</span>, $<span style="color: #a0522d;">ds</span>, $<span style="color: #a0522d;">sCheck</span>);
        <span style="color: #000000; background-color: #ffffff;">preg_match(</span>$<span style="color: #a0522d;">notCoolBro</span>, $<span style="color: #a0522d;">df</span>, $<span style="color: #a0522d;">fCheck</span>);  


        <span style="color: #b22222;">//</span><span style="color: #b22222;">if a match is found, return out and print error msg. If no matches are found, strip any slashes, and assign new variable.     </span>
        <span style="color: #a020f0;">if</span> ($<span style="color: #a0522d;">sCheck</span> != <span style="color: #008b8b;">NULL</span> ) {
                <span style="color: #000000; background-color: #ffffff;">die(</span><span style="color: #8b2252;">'broke at select check'</span>);
        } <span style="color: #a020f0;">else</span> {
                $<span style="color: #a0522d;">s</span> = <span style="color: #000000; background-color: #ffffff;">stripslashes(</span>$<span style="color: #a0522d;">ds</span>);
        }

        <span style="color: #a020f0;">if</span> ($<span style="color: #a0522d;">fCheck</span> != <span style="color: #008b8b;">NULL</span> ) {
                <span style="color: #000000; background-color: #ffffff;">die(</span><span style="color: #8b2252;">'broke at from check'</span>);
        } <span style="color: #a020f0;">else</span> {
                $<span style="color: #a0522d;">f</span> = <span style="color: #000000; background-color: #ffffff;">stripslashes(</span>$<span style="color: #a0522d;">df</span>);
        }

        <span style="color: #b22222;">//</span><span style="color: #b22222;">Check to see if there WHERE field was used.</span>
        <span style="color: #a020f0;">if</span>($<span style="color: #a0522d;">where</span> != <span style="color: #008b8b;">NULL</span>){
                $<span style="color: #a0522d;">dw</span> = $<span style="color: #a0522d;">where</span>;

                <span style="color: #b22222;">//</span><span style="color: #b22222;">more input checking and assembling of query based off of where verb.          </span>
                <span style="color: #000000; background-color: #ffffff;">preg_match(</span>$<span style="color: #a0522d;">notCoolBro</span>, $<span style="color: #a0522d;">dw</span>, $<span style="color: #a0522d;">wCheck</span>);          

                <span style="color: #a020f0;">if</span> ($<span style="color: #a0522d;">wCheck</span> != <span style="color: #008b8b;">NULL</span>) {
                        <span style="color: #000000; background-color: #ffffff;">die(</span><span style="color: #8b2252;">'broke at where check'</span>);
                } <span style="color: #a020f0;">else</span> {
                        $<span style="color: #a0522d;">w</span> = <span style="color: #000000; background-color: #ffffff;">stripslashes(</span>$<span style="color: #a0522d;">dw</span>);
                }       
                $<span style="color: #a0522d;">query</span> = <span style="color: #8b2252;">'select '</span>.$<span style="color: #a0522d;">s</span>.<span style="color: #8b2252;">' from '</span>.$<span style="color: #a0522d;">f</span>.<span style="color: #8b2252;">' where '</span>.$<span style="color: #a0522d;">w</span>.<span style="color: #8b2252;">';'</span>;
        } <span style="color: #a020f0;">else</span> {
                $<span style="color: #a0522d;">query</span> = <span style="color: #8b2252;">'select '</span>.$<span style="color: #a0522d;">s</span>.<span style="color: #8b2252;">' from '</span>.$<span style="color: #a0522d;">f</span>.<span style="color: #8b2252;">';'</span>;
        }

        <span style="color: #b22222;">// </span><span style="color: #b22222;">Connect to the MySQL server.</span>
        <span style="color: #a020f0;">include</span> <span style="color: #8b2252;">'../../../sq_connect.inc'</span>;

        <span style="color: #b22222;">// </span><span style="color: #b22222;">Die if no connect</span>
        <span style="color: #a020f0;">if</span> (!$<span style="color: #a0522d;">LinkID</span>) {
                <span style="color: #000000; background-color: #ffffff;">die(</span><span style="color: #8b2252;">'Could not connect: '</span> . <span style="color: #000000; background-color: #ffffff;">mysql_error(</span>));
        }
        <span style="color: #b22222;">// </span><span style="color: #b22222;">Choose the DB and run a query.</span>
        <span style="color: #000000; background-color: #ffffff;">mysql_select_db(</span><span style="color: #8b2252;">"comp170"</span>, $<span style="color: #a0522d;">LinkID</span>);
        $<span style="color: #a0522d;">result</span> = <span style="color: #000000; background-color: #ffffff;">mysql_query(</span>$<span style="color: #a0522d;">query</span>, $<span style="color: #a0522d;">LinkID</span>);

        <span style="color: #000000; background-color: #ffffff;">mysql_data_seek(</span>$<span style="color: #a0522d;">result</span>, <span style="color: #000000; background-color: #ffffff;">0</span>);
        <span style="color: #b22222;">// </span><span style="color: #b22222;">Fetch a row with the column labels</span>
        $<span style="color: #a0522d;">x</span> = <span style="color: #000000; background-color: #ffffff;">mysql_fetch_assoc(</span>$<span style="color: #a0522d;">result</span>);
        $<span style="color: #a0522d;">resultArray</span> = <span style="color: #000000; background-color: #ffffff;">array(</span>);
        $<span style="color: #a0522d;">one</span> = <span style="color: #000000; background-color: #ffffff;">array(</span>);
        $<span style="color: #a0522d;">two</span> = <span style="color: #000000; background-color: #ffffff;">array(</span>);

        <span style="color: #a020f0;">foreach</span>($<span style="color: #a0522d;">x</span> <span style="color: #a020f0;">as</span> $<span style="color: #a0522d;">x</span>=<span style="color: #008b8b;">&gt;</span>$<span style="color: #a0522d;">k</span>) {
                $<span style="color: #a0522d;">one</span>[] = $<span style="color: #a0522d;">x</span>;
                $<span style="color: #a0522d;">two</span>[] = $<span style="color: #a0522d;">k</span>;
        }

        $<span style="color: #a0522d;">resultArray</span>[] = $<span style="color: #a0522d;">one</span>;
        $<span style="color: #a0522d;">resultArray</span>[] = $<span style="color: #a0522d;">two</span>;

        <span style="color: #a020f0;">while</span> ($<span style="color: #a0522d;">x</span> = <span style="color: #000000; background-color: #ffffff;">mysql_fetch_row(</span>$<span style="color: #a0522d;">result</span>)) {
                $<span style="color: #a0522d;">one</span> = <span style="color: #000000; background-color: #ffffff;">array(</span>);
                <span style="color: #a020f0;">foreach</span>($<span style="color: #a0522d;">x</span> <span style="color: #a020f0;">as</span> $<span style="color: #a0522d;">x</span>=&gt;$<span style="color: #a0522d;">k</span>) {
                        $<span style="color: #a0522d;">one</span>[] = $<span style="color: #a0522d;">k</span>;
                }
        $<span style="color: #a0522d;">resultArray</span>[] = $<span style="color: #a0522d;">one</span>;
        }

<span style="color: #b22222;">// </span><span style="color: #b22222;">Create the output array</span>
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'name'</span>]     = <span style="color: #8b2252;">"Lab 8"</span>;
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'outTitle'</span>] = <span style="color: #8b2252;">"Output"</span>;
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'outValue'</span>] = $<span style="color: #a0522d;">resultArray</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">Create the input array</span>
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'inTitle'</span>]  = <span style="color: #8b2252;">"Input"</span>;
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'inValue'</span>][<span style="color: #8b2252;">'select'</span>]  = $<span style="color: #a0522d;">select</span>;
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'inValue'</span>][<span style="color: #8b2252;">'from'</span>]  = $<span style="color: #a0522d;">from</span>;
    $<span style="color: #a0522d;">list</span>[<span style="color: #8b2252;">'inValue'</span>][<span style="color: #8b2252;">'where'</span>]  = $<span style="color: #a0522d;">where</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">Return the array</span>
    <span style="color: #a020f0;">return</span> $<span style="color: #a0522d;">list</span>;
  }
<span style="color: #483d8b;">?&gt;</span>
</pre>

</div>

</div>
