PHP/lab8/index.html

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> toXML.php</h4>
<div class="outline-text-4" id="text-1-1-3">




<pre class="src src-php"><span style="color: #483d8b;">&lt;?php</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Convert the input array to XML</span>
  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">toXML</span>($<span style="color: #a0522d;">inArray</span>) {

<span style="color: #b22222;">//    </span><span style="color: #b22222;">$document = new DomDocument('1.0');</span>
    $<span style="color: #a0522d;">document</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">DomDocument</span>(<span style="color: #8b2252;">"1.0"</span>, <span style="color: #8b2252;">"ISO-8859-15"</span>);

<span style="color: #b22222;">/*  </span>
<span style="color: #b22222;">    The following does not work for most browser.  They seem to take offence with the </span>
<span style="color: #b22222;">    DOCTYPE line added by the LoadHTML.  This is now done after the document has been created</span>
<span style="color: #b22222;">    below.</span>
<span style="color: #b22222;">*/</span>

<span style="color: #b22222;">//  </span><span style="color: #b22222;">Tell the resulting XML that this extensible style sheet will transform the resulting XML</span>
<span style="color: #b22222;">//    </span><span style="color: #b22222;">$foo = $document-&gt;</span><span style="color: #000000; background-color: #ffffff;">loadHTML</span><span style="color: #b22222;">('&lt;?xml-stylesheet type="text/xsl" href="view.xsl"&gt;'); </span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">create the root node</span>
    $<span style="color: #a0522d;">root</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'root'</span>);
    $<span style="color: #a0522d;">root</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">root</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">create the title node</span>
    $<span style="color: #a0522d;">elemt</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'title'</span>);
    $<span style="color: #a0522d;">elemt</span> = $<span style="color: #a0522d;">root</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elemt</span>);

    $<span style="color: #a0522d;">elem0</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createTextNode</span>($<span style="color: #a0522d;">inArray</span>[<span style="color: #8b2252;">'name'</span>]);
    $<span style="color: #a0522d;">elem0</span> = $<span style="color: #a0522d;">elemt</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elem0</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">create the input data node</span>
    $<span style="color: #a0522d;">elem1</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'Input'</span>);
    $<span style="color: #a0522d;">elem1</span> = $<span style="color: #a0522d;">root</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elem1</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">create the input title node</span>
    $<span style="color: #a0522d;">elemt</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'title'</span>);
    $<span style="color: #a0522d;">elemt</span> = $<span style="color: #a0522d;">elem1</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elemt</span>);

    $<span style="color: #a0522d;">elem0</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createTextNode</span>($<span style="color: #a0522d;">inArray</span>[<span style="color: #8b2252;">'inTitle'</span>]);
    $<span style="color: #a0522d;">elem0</span> = $<span style="color: #a0522d;">elemt</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elem0</span>);

    <span style="color: #a020f0;">foreach</span> ($<span style="color: #a0522d;">inArray</span>[<span style="color: #8b2252;">'inValue'</span>] <span style="color: #a020f0;">as</span> $<span style="color: #a0522d;">name</span> =&gt; $<span style="color: #a0522d;">value</span>) {
<span style="color: #b22222;">// </span><span style="color: #b22222;">add a child node for each input entry</span>
      $<span style="color: #a0522d;">entry</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'entry'</span>);
      $<span style="color: #a0522d;">entry</span> = $<span style="color: #a0522d;">elem1</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">entry</span>);

      $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'name'</span>);
      $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">entry</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">child</span>);

      $<span style="color: #a0522d;">v0</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createTextNode</span>($<span style="color: #a0522d;">name</span>);
      $<span style="color: #a0522d;">v0</span> = $<span style="color: #a0522d;">child</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">v0</span>);

      $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'value'</span>);
      $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">entry</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">child</span>);

      $<span style="color: #a0522d;">v1</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createTextNode</span>($<span style="color: #a0522d;">value</span>);
      $<span style="color: #a0522d;">v1</span> = $<span style="color: #a0522d;">child</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">v1</span>);
    }
<span style="color: #b22222;">// </span><span style="color: #b22222;">create the output data node</span>
    $<span style="color: #a0522d;">elem2</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'Output'</span>);
    $<span style="color: #a0522d;">elem2</span> = $<span style="color: #a0522d;">root</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elem2</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">create the output title node</span>
    $<span style="color: #a0522d;">elemt</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'title'</span>);
    $<span style="color: #a0522d;">elemt</span> = $<span style="color: #a0522d;">elem2</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elemt</span>);

    $<span style="color: #a0522d;">elem0</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createTextNode</span>($<span style="color: #a0522d;">inArray</span>[<span style="color: #8b2252;">'outTitle'</span>]);
    $<span style="color: #a0522d;">elem0</span> = $<span style="color: #a0522d;">elemt</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">elem0</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">add a child node for each output entry</span>
    <span style="color: #a020f0;">foreach</span> ($<span style="color: #a0522d;">inArray</span>[<span style="color: #8b2252;">'outValue'</span>] <span style="color: #a020f0;">as</span> $<span style="color: #a0522d;">name</span> =&gt; $<span style="color: #a0522d;">value</span>) {

                $<span style="color: #a0522d;">entry</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'entry'</span>);
                $<span style="color: #a0522d;">entry</span> = $<span style="color: #a0522d;">elem2</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">entry</span>);

                $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'name'</span>);
                $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">entry</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">child</span>);
                <span style="color: #a020f0;">foreach</span> ($<span style="color: #a0522d;">value</span> <span style="color: #a020f0;">as</span> $<span style="color: #a0522d;">key</span> =&gt; $<span style="color: #a0522d;">data</span>){

                $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createElement</span>(<span style="color: #8b2252;">'value'</span>);
                $<span style="color: #a0522d;">child</span> = $<span style="color: #a0522d;">entry</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">child</span>);

                $<span style="color: #a0522d;">v1</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">createTextNode</span>($<span style="color: #a0522d;">data</span>);
                $<span style="color: #a0522d;">v1</span> = $<span style="color: #a0522d;">child</span>-&gt;<span style="color: #000000; background-color: #ffffff;">appendChild</span>($<span style="color: #a0522d;">v1</span>);
                }
    }

<span style="color: #b22222;">// </span><span style="color: #b22222;">return the completed xml document formatted nicely.</span>
    $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #a0522d;">formatOutput</span> = <span style="color: #008b8b;">true</span>;
    $<span style="color: #a0522d;">doc</span> = $<span style="color: #a0522d;">document</span>-&gt;<span style="color: #000000; background-color: #ffffff;">saveXML</span>();

<span style="color: #b22222;">// </span><span style="color: #b22222;">Split the XML into an array and add in the style sheet information then put it back together into a string.</span>
    $<span style="color: #a0522d;">docArray</span> = <span style="color: #000000; background-color: #ffffff;">split(</span><span style="color: #8b2252;">"\n"</span>, $<span style="color: #a0522d;">doc</span>);
    <span style="color: #000000; background-color: #ffffff;">array_splice(</span>$<span style="color: #a0522d;">docArray</span>, <span style="color: #000000; background-color: #ffffff;">1</span>, <span style="color: #000000; background-color: #ffffff;">0</span>, <span style="color: #8b2252;">'&lt;?xml-stylesheet type="text/xsl" href="view.xsl"?&gt;'</span>);
    $<span style="color: #a0522d;">doc</span> = <span style="color: #000000; background-color: #ffffff;">join(</span><span style="color: #8b2252;">"\n"</span>, $<span style="color: #a0522d;">docArray</span>);
    <span style="color: #a020f0;">return</span> $<span style="color: #a0522d;">doc</span>;
  }
<span style="color: #483d8b;">?&gt;</span>
</pre>

</div>

</div>
